# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# taps
tap 'aws/tap'

# Enable app store installations
brew "mas"

# Casks
cask "bitwarden"
cask "easy-move-plus-resize"
cask "firefox"
cask "google-drive"
cask "iterm2"
cask "maccy"
cask "obsidian"
cask "omnifocus"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "syncthing"
cask "visual-studio-code"
cask "zen-browser"

# General packages
brew "awscurl"
brew "bash"
brew "zsh"
brew "zsh-completions"
