# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# taps
tap 'homebrew/cask'
tap 'aws/tap'
tap 'homebrew/cask-versions'

# Enable app store installations
brew "mas"

# Casks
cask "alfred"
cask "authy"
cask "bitwarden"
cask "copyclip"
cask "finch"
cask "finicky"
cask "firefox"
cask "google-drive"
cask "iterm2"
cask "obsidian"
#cask "omnifocus" # Latest omnifocus needs macOS 11+; commenting out until everything is updated
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "syncthing"
cask "visual-studio-code"

# General packages
brew "aws/tap/aws-sam-cli"
brew "awscli"
brew "awscurl"
brew "bash"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diffutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "gcal"
brew "git"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gpg"
brew "grep"
brew "gzip"
brew "jq"
brew "less"
brew "make"
brew "ncdu"
brew "node"
brew "python"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "zsh"
brew "zsh-completions"
